gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_ioctrl/User/main.c
	if (TCFG_Utility_Get_Nbiot_IdleLifetime() > 0) {
		/* NBIOT APP Task */
		NET_NBIOT_App_Task();
	}
	else {
		/* NBIOT Power OFF */
		if (NBIOTPOWER_IO_READ()) {
			NET_NBIOT_Initialization();
			NBIOTPOWER(OFF);
		}
	}
	
	/* 小无线处理 */
	Radio_Trf_App_Task();
}

/* ============================================ 倒放处理 =============================================== */

/**********************************************************************************************************
 @Function			void MainRollingEnteredDownSleep(void)
 @Description			MainRollingEnteredDownSleep				: 已进入倒放休眠状态
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteredDownSleep(void)
{
	BEEP_CtrlRepeat_Extend(1, 500, 0);
}

/**********************************************************************************************************
 @Function			void MainRollingEnteredDownWork(void)
 @Description			MainRollingEnteredDownWork				: 已进入倒放工作状态
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteredDownWork(void)
{
#if NETPROTOCAL == NETCOAP
	NETCoapNeedSendCode.WorkInfoWait = 3;
#elif NETPROTOCAL == NETMQTTSN
	NETMqttSNNeedSendCode.InfoWorkWait = 3;
#elif NETPROTOCAL == NETONENET
	NETOneNETNeedSendCode.WorkInfoWait = 3;
#endif
}

/**********************************************************************************************************
 @Function			void MainRollingEnteredDownSleepKeepActived(void)
 @Description			MainRollingEnteredDownSleepKeepActived		: 将进入倒放休眠状态前保持工作
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteredDownSleepKeepActived(void)
{
	/* 日常处理 */
	MainHandleRoutine();
	
	if (!((NETCoapNeedSendCode.WorkInfoWait > 0) || (NETMqttSNNeedSendCode.InfoWorkWait > 0) || (NETOneNETNeedSendCode.WorkInfoWait > 0))) {
#if PRODUCTTEST_READ_TYPE
#if (IOCTRL_MODEL_TYPE == 0)
		if (ProductTest_Read()) {
#endif
			/* NBIOT APP Task */
			NET_NBIOT_App_Task();
#if (IOCTRL_MODEL_TYPE == 0)
		}
		else {
			/* NBIOT Power OFF */
			if (NBIOTPOWER_IO_READ()) {
				NET_NBIOT_Initialization();
				NBIOTPOWER(OFF);
			}
		}
#endif
#else
		/* NBIOT APP Task */
		NET_NBIOT_App_Task();
#endif
	}
}

/**********************************************************************************************************
 @Function			void MainRollingEnteringDownSleep(void)
 @Description			MainRollingEnteringDownSleep				: 将进入倒放休眠
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingEnteringDownSleep(void)
{
	/* NBIOT Power OFF */
	if (NBIOTPOWER_IO_READ()) {
		NET_NBIOT_Initialization();
		NBIOTPOWER(OFF);
	}
}

/**********************************************************************************************************
 @Function			void MainRollingDownSleep(void)
 @Description			MainRollingDownSleep					: 倒放休眠中
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainRollingDownSleep(void)
{
	/* NBIOT Power OFF */
	if (NBIOTPOWER_IO_READ()) {
		NET_NBIOT_Initialization();
		NBIOTPOWER(OFF);
	}
}

/* ============================================ 日常处理 =============================================== */

/**********************************************************************************************************
 @Function			void MainHandleRoutine(void)
 @Description			MainHandleRoutine
 @Input				void
 @Return				void
**********************************************************************************************************/
void MainHandleRoutine(void)
{
	uint8_t val8;
	Qmc5883LStatusDataTypeDef QmcStatusData;
	
	/* Every Second Running */
	if (Stm32_GetSecondTick() != SystemRunningTime.seconds) {
		SystemRunningTime.seconds = Stm32_GetSecondTick();
		
#if IOCTRL_MODEL_TYPE
		IOControl_IO1_Check(&IOControlIO1Time);
		IOControl_IO2_Check(&IOControlIO2Time);
#endif
	}
	/* Every Ten Secound Running */
	if ((Stm32_GetSecondTick() / 10) != SystemRunningTime.tenseconds) {
		SystemRunningTime.tenseconds = Stm32_GetSecondTick() / 10;
		
#if NETPROTOCAL == NETCOAP
		if (NETCoapNeedSendCode.WorkInfoWait > 0) {
			if (NETCoapNeedSendCode.WorkInfoWait > 1) {
				__NOP();
			}
			else if (NETCoapNeedSendCode.WorkInfoWait > 0) {
			#if NBCOAP_SENDCODE_WORK_INFO
				NETCoapNeedSendCode.WorkInfo = 1;
			#endif
			}
			NETCoapNeedSendCode.WorkInfoWait--;
		}
#endif
#if NETPROTOCAL == NETMQTTSN
		if (NETMqttSNNeedSendCode.InfoWorkWait > 0) {
			if (NETMqttSNNeedSendCode.InfoWorkWait > 1) {
				__NOP();
			}
			else if (NETMqttSNNeedSendCode.InfoWorkWait > 0) {
			#if NBMQTTSN_SENDCODE_WORK_INFO
				NETMqttSNNeedSendCode.InfoWork = 1;
			#endif
			}
			NETMqttSNNeedSendCode.InfoWorkWait--;
		}
#endif
#if NETPROTOCAL == NETONENET
		if (NETOneNETNeedSendCode.WorkInfoWait > 0) {
			if (NETOneNETNeedSendCode.WorkInfoWait > 1) {
				__NOP();
			}
			else if (NETOneNETNeedSendCode.WorkInfoWait > 0) {
			#if NBONENET_SENDCODE_WORK_INFO
				NETOneNETNeedSendCode.WorkInfo = 1;
			#endif
			}
			NETOneNETNeedSendCode.WorkInfoWait--;
		}
#endif
		TCFG_Utility_Sub_Nbiot_IdleLifetime();
	}
	/* Every Minutes Running */
	if ((Stm32_GetSecondTick() / 60) != SystemRunningTime.minutes) {
		SystemRunningTime.minutes = Stm32_GetSecondTick() / 60;
		
	}
	/* Every FifteenMinutes Running */
	if ((Stm32_GetSecondTick() / 900) != SystemRunningTime.fifteenMinutes) {
		SystemRunningTime.fifteenMinutes = Stm32_GetSecondTick() / 900;
		
		QMC5883L_Temperature_Read();
		QmcStatusData.X = Qmc5883lData.X_Now;
		QmcStatusData.Y = Qmc5883lData.Y_Now;
		QmcStatusData.Z = Qmc5883lData.Z_Now;
		QmcStatusData.Temperature = Qmc5883lData.temp_now;
		QmcStatusData.Status = talgo_get_spotstatus();
		Inspect_Message_QmcStatusEnqueue(QmcStatusData);
	}
	/* Every FortyMinutes Running */
	if ((Stm32_GetSecondTick() / 2400) != SystemRunningTime.fortyMinutes) {
		SystemRunningTime.fortyMinutes = Stm32_GetSecondTick() / 2400;
		
		if (RTC_Time_GetCurrentHour() == 7) {
			if (Inspect_Message_SpotStatusisEmpty() != false) {
				NET_NBIOT_Initialization();
			}
			
			if (TCFG_EEPROM_GetNbiotHeart() > NBIOT_HEART_DATA_HOURS) {
				TCFG_SystemData.NBIotHeart = NBIOT_HEART_DATA_HOURS;
				TCFG_EEPROM_SetNbiotHeart(TCFG_SystemData.NBIotHeart);
			}
			
			if ((TCFG_EEPROM_GetNBIotSentCountDay() != 0) || (TCFG_SystemData.NBIotSentCountDay != 0)) {
				TCFG_SystemData.NBIotSentCountDay = 0;
				TCFG_EEPROM_SetNBIotSentCountDay(TCFG_SystemData.NBIotSentCountDay);
			}
		}
	}
	/* Every Hours Running */
	if ((Stm32_GetSecondTick() / 3600) != SystemRunningTime.hours) {
		SystemRunningTime.hours = Stm32_GetSecondTick() / 3600;
		
		val8 = TCFG_EEPROM_GetCoapRATimeHour();
		if ((val8 != 0) && (SystemRunningTime.hours % val8 == 0)) {
			NBIOT_COAP_RA_NORMAL_SET_STATE(&NbiotClientHandler, true);
		}
	}
	/* Every TwoHours Running */
	if ((Stm32_GetSecondTick() / 7200) != SystemRunningTime.twoHours) {
		SystemRunningTime.twoHours = Stm32_GetSecondTick() / 7200;
		
		if (TCFG_GetRadarCount() != TCFG_EEPROM_GetRadarCount()) {
			TCFG_EEPROM_SetRadarCount(TCFG_GetRadarCount());
		}
		
		TCFG_SystemData.MagBackgroundX = Qmc5883lData.X_Back;
		TCFG_SystemData.MagBackgroundY = Qmc5883lData.Y_Back;
		TCFG_SystemData.MagBackgroundZ = Qmc5883lData.Z_Back;
		TCFG_EEPROM_SetMagBackgroud(TCFG_SystemData.MagBackgroundX, TCFG_SystemData.MagBackgroundY, TCFG_SystemData.MagBackgroundZ);
		
		TCFG_SystemData.MagBackgroudTemp = Qmc5883lData.temp_back;
		TCFG_EEPROM_SetMagBackgroudTemp(TCFG_SystemData.MagBackgroudTemp);
	}
	/* Every FourHours Running */
	if ((Stm32_GetSecondTick() / (4*3600)) != SystemRunningTime.fourHours) {
		SystemRunningTime.fourHours = Stm32_GetSecondTick() / (4*3600);
		
#if NETPROTOCAL == NETCOAP
	#if NBCOAP_SENDCODE_QMC_DATA
		NETCoapNeedSendCode.QmcData = 1;
	#endif
#elif NETPROTOCAL == NETMQTTSN
	#if NBMQTTSN_SENDCODE_QMC_DATA
		NETMqttSNNeedSendCode.QmcData = 1;
	#endif
#elif NETPROTOCAL == NETONENET
	#if NBONENET_SENDCODE_QMC_DATA
		NETOneNETNeedSendCode.QmcData = 1;
	#endif
#endif
	}
	/* Every Day Running */
	if ((Stm32_GetSecondTick() / (24*3600)) != SystemRunningTime.days) {
		SystemRunningTime.days = Stm32_GetSecondTick() / (24*3600);
		
#if NETPROTOCAL == NETCOAP
	#if NBCOAP_SENDCODE_WORK_INFO
		NETCoapNeedSendCode.WorkInfo = 1;
	#endif
	#if NBCOAP_SENDCODE_DYNAMIC_INFO
		NETCoapNeedSendCode.DynamicInfo = 1;
	#endif
#elif NETPROTOCAL == NETMQTTSN
	#if NBMQTTSN_SENDCODE_WORK_INFO
		NETMqttSNNeedSendCode.InfoWork = 1;
	#endif
	#if NBMQTTSN_SENDCODE_DYNAMIC_INFO
		NETMqttSNNeedSendCode.InfoDynamic = 1;
	#endif
#elif NETPROTOCAL == NETONENET
	#if NBONENET_SENDCODE_WORK_INFO
		NETOneNETNeedSendCode.WorkInfo = 1;
	#endif
	#if NBONENET_SENDCODE_DYNAMIC_INFO
		NETOneNETNeedSendCode.DynamicInfo = 1;
	#endif
#endif
		
		TCFG_SystemData.CoapConnectTime = TCFG_Utility_GetCoapConnectTime();
		TCFG_EEPROM_SetCoapConnectTime(TCFG_SystemData.CoapConnectTime);
		
		TCFG_SystemData.CoapIdleTime = TCFG_Utility_GetCoapIdleTime();
		TCFG_EEPROM_SetCoapIdleTime(TCFG_SystemData.CoapIdleTime);
		
		NBIOT_COAP_RA_NORMAL_SET_STATE(&NbiotClientHandler, true);
		TCFG_Utility_Set_Nbiot_IdleLifetime(NBIOT_MAX_LIFETIME);
		
#if NETPROTOCAL == NETMQTTSN
	#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_ENABLE
		DNS_Analysis_Set_CtrlState(&DNSClientHandler, true);
	#endif
#endif
	}
	/* Every Week Running */
	if ((Stm32_GetSecondTick() / (24*3600*7)) != SystemRunningTime.weeks) {
		SystemRunningTime.weeks = Stm32_GetSecondTick() / (24*3600*7);
		
#if NETPROTOCAL == NETCOAP
	#if NBCOAP_SENDCODE_BASIC_INFO
		NETCoapNeedSendCode.BasicInfo = 1;
	#endif
#elif NETPROTOCAL == NETMQTTSN
	#if NBMQTTSN_SENDCODE_BASIC_INFO
		NETMqttSNNeedSendCode.InfoBasic = 1;
	#endif
#elif NETPROTOCAL == NETONENET
	#if NBONENET_SENDCODE_BASIC_INFO
		NETOneNETNeedSendCode.BasicInfo = 1;
	#endif
#endif
	}
}

void Control_KEY1_ON(void)
{
	GPIO_InitTypeDef GPIO_Initure;
	
	__HAL_RCC_GPIOB_CLK_ENABLE();
	
